In [276]:
import pandas as pd
import requests

## ToDo
- Load the countries.csv directly via URL import into your panda data frame!
- Display some basic information as rows, columns and some basic statistical info.
- Show the last 4 rows of the data frame.
- Show all the row of countries who have the EURO
- Show only name and Currency in a new data frame
- Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)
- Select all countries where with inhabitants between 50 and 150 Mio
- Change BIP to Bip
- Calculate the Bip sum
- Calculate the average people of all countries
- Sort by name alphabetically
- Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!

### 1. Load data directly via URL import into pandas data frame

In [319]:
url = 'https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv'

In [320]:
src = requests.get(url).content
string = src.decode('utf-8').split('\n')

In [321]:
col = string.pop(0).split(',')
string = [line.split(',') for line in string][:-1]
df = pd.DataFrame(columns = col, index=None)

In [322]:
data = {}
for line in string:
    for i in range(len(col)):
        data.update({col[i]: line[i]})
    df = df.append(data, ignore_index=True)
df

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### 2. Display some basic information & statistical infos

In [323]:
df.describe()

          Name     People     Area   BIP Currency
count        5          5        5     5        5
unique       5          5        5     5        4
top     Canada  126045000  9984670  1798      EUR
freq         1          1        1     1        2

In [324]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   People    5 non-null      object
 2   Area      5 non-null      object
 3   BIP       5 non-null      object
 4   Currency  5 non-null      object
dtypes: object(5)
memory usage: 328.0+ bytes

In [325]:
df.index, df.columns

(RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object'))

### 3. Show the last 4 rows of the data frame

In [326]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### 4. Show all the row of countries who have the EURO

In [327]:
df[df['Currency'] == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

### 5.  Show only name and Currency in a new data frame

In [328]:
df_nc = df[['Name', 'Currency']]
df_nc

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

### 6. Show only the rows that have > 2000 BIP

In [329]:
df = df.astype({'BIP': np.int})
df[df['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

### 7. Select all countries with inhabitants between 50 and 150 Mio

In [330]:
df = df.astype({'People': np.int})
df[(df['People'] > 50000000) & (df['People'] < 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

### 8. Change BIP to Bip

In [331]:
df.columns

Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object')

In [332]:
df.rename(columns={'BIP':'Bip'}, inplace=True)
df.columns

Index(['Name', 'People', 'Area', 'Bip', 'Currency'], dtype='object')

### 9. Calculate the Bip sum

In [333]:
df['Bip'].sum()

13581

### 10. Calculate the average people of all countries

In [334]:
df['People'].mean()

102786293.6

### 11. Sort by name alphabetically

In [335]:
df.sort_values('Name', ascending=True)

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

### 12. Create a new data frame 
Where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!

In [336]:
df = df.astype({'Area': np.int})

In [337]:
df['People'].where(~(df.People > 1000000), other='BIG', inplace=True)
df['Area'].where(~(df.Area > 1000000), other='BIG', inplace=True)
df['People'].where(~(df.People !='BIG'), other='SMALL', inplace=True)
df['Area'].where(~(df.Area != 'BIG'), other='SMALL', inplace=True)
df['Bip'].where(~(df.Bip <= 1000000), other='SMALL', inplace=True)

In [338]:
df

       Name People   Area    Bip Currency
0   Germany    BIG  SMALL  SMALL      EUR
1     Japan    BIG  SMALL  SMALL      YEN
2    Canada    BIG    BIG  SMALL      CAD
3     Italy    BIG  SMALL  SMALL      EUR
4  Brazilia    BIG    BIG  SMALL     REAL